# Напишите функцию, которая будет принимать номер кредитной карты и
# показывать только последние 4 цифры. Остальные цифры должны заменяться
# звездочками

# def nomer_karti(karta):
#     return karta
# a=int(input("Введите первые 4-е цифры карты"))
# b=int(input("Введите вторые 4-е цифры карты"))
# c=int(input("Введите следующие 4-е цифры карты"))
# d=int(input("Введите последние 4-е цифры карты"))
# karta=[a,b,c,d]
# print ('Карта:', '****','****','****', karta[3])


# Напишите функцию, которая проверяет: является ли слово палиндромом
# def polindrom(p):
#     if len(p)<=1:
#         return True
#     if s[0]!=s[-1]:
#         return False
#     return polindrom(s[1:-1])
# print(polindrom('алла'))

# Класс Tomato:
# 1. Создайте класс Tomato
# 2. Создайте статическое свойство states, которое будет содержать все стадии
# созревания помидора
# 3. Создайте метод __init__(), внутри которого будут определены два динамических
# protected свойства: 1) _index - передается параметром и 2) _state - принимает первое
# значение из словаря states
# 4. Создайте метод grow(), который будет переводить томат на следующую стадию
# созревания
# 5. Создайте метод is_ripe(), который будет проверять, что томат созрел (достиг
# последней стадии созревания)

